[
  {
    "Image Cover": "https://www.studentrentalslacrosse.com/wp-content/uploads/2021/09/Sep2021.jpg",
    "Title": "Student Rentals La Crosse reached new single day record.",
    "Link": "https://www.studentrentalslacrosse.com/new-record-1-day-traffic/",
    "Date": "September 27, 2021",
    "Content": "\nOn Sep 22, 2021 we hit an all time 1 day record for users.  On Sep 22 we had 534 students looking for student rentals reach our Web site.  Students looking for leases for the following school year (2022-2023) reached an all time high single day traffic count.\nHow do we know the traffic has peaked for 2021?  Tracking for the last six years, traffic peaks in the 3rd week of September every year. EVERY YEAR. Students come back to campus after Labor Day and immediately are looking for off-campus housing for the following school year. \nI don’t think anyone told students to do this.  Some landlord are not ready to advertise their properties yet. In fact landlords are still gathering information as to who is staying for the following year.\n2021 Sep 22 – 534 visitors\n2020 Sep 21 – 393 visitors\n2019 Sep 19 – 441 visitors\n2018 Sep 25 – 412 visitors\n2017 Sep 26 – 366 visitors\n2016 Sep 27 – 264 visitors  \nLandlords: If you want to reach the most students looking for off-campus housing, the first 3 weeks in September is the time to have your properties available. The early birds are the some of the best renters!\n[click on image to enlarge]\n\n",
    "Author": "gmader"
  },
  {
    "Image Cover": null,
    "Title": "Need extra help listing properties?",
    "Link": "https://www.studentrentalslacrosse.com/need-extra-help-listing-properties/",
    "Date": "April 21, 2021",
    "Content": "\nIn March of 2021 a landlord contacted us to help get more exposure to finish renting their remaining 5 properties.  We offered the following options.  \n\nAdd a banner and linking it to a list of the properties\nAdd a green ‘AVAILABLE’ triangle to the main photo\nPhoto placement in top 5 positions on homepage Slideshow\nPlace an embedded video on each listing\nInitiate 20 social media posts on Facebook pages\nPlace yard signs on each property\n\nWe put all these items in effect March 8.  By April 10 after a rush of inquiries they were all filled.\n",
    "Author": "gmader"
  },
  {
    "Image Cover": "https://www.studentrentalslacrosse.com/wp-content/uploads/2021/03/2020-SRL-graph.jpg",
    "Title": "When should landlords list properties for the following school year?",
    "Link": "https://www.studentrentalslacrosse.com/when-should-landlords-list-properties-for-the-following-school-year/",
    "Date": "April 21, 2021",
    "Content": "\nWhen should landlords list properties for the following school year? Get prepared in August .  When students return in September they are looking for housing for the following school year. From the past 6yr history, September and October of each year receive the highest traffic of any other months. (Ask to view 6yr history)\n\n",
    "Author": "gmader"
  },
  {
    "Image Cover": "https://www.studentrentalslacrosse.com/wp-content/uploads/2021/03/2021-SRL-graph-April.jpg",
    "Title": "SRL – 2021 Traffic",
    "Link": "https://www.studentrentalslacrosse.com/2021-traffic/",
    "Date": "March 4, 2021",
    "Content": "\nSo far first four months traffic this year is ahead of last year. Good time to list your 2021-2022 student rental properties.\n\n\n",
    "Author": "gmader"
  }
]
